cases/openfoam.org/bifluidicOscillator/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           0.4;
maxAlphaCo      1;

maxDeltaT       0.001;

libs
(
    "libgroovyBC.so" 
    "libutilityFunctionObjects.so"
    "libsolverFunctionObjects.so"
);

functions
{
    S
    {
        type            scalarTransport;
        writeControl    outputTime;
        field           S;
        nCorr           0;
        D               0;
        resetOnStartUp  false;
        autoSchemes     true;
        fvOptions       
        {
            source
            {
                type            scalarSemiImplicitSource;
                active          true;

                scalarSemiImplicitSourceCoeffs
                {
                    selectionMode   cellZone;
                    cellZone        c0;
                    volumeMode      specific;

                    injectionRateSuSp
                    {
                        S   (5 0);
                    }
                }
            }
        };
    }
}

// ************************************************************************* //
