cases/openfoam.org/bifluidicOscillator/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.005;

boundaryField
{
    back
    {
        type            empty;
    }
    freeWalls
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.0002538;
        phi             phi;
        k               k;
        value           uniform 0.005;
    }
    top 
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    bottom 
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    walls
    {
        type            omegaWallFunction;
        value           uniform 0.005;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
}


// ************************************************************************* //
